; Український мовний файл v3.7.2
; Автор: Volodiimr & Dtuffg
; В ключi codepage має бути вказаний номер кодової сторiнки для цiєї мови (напр. 1251 для русского i для української i т.д.).
codepage=1251
error=ПОМИЛКА^!
startup_error1=Batch ApkTool не має повного доступу до теки, або шлях встановлення мiстить недопустимi символи
startup_error2=Batch ApkTool не має дозволу на запис у теку
previous_java1=У вас встановлена Java
previous_java2=Для коректної роботи Batch ApkTool потрiбна Java 8 або вище
get_java=Завантажити найновiщу версiю Java можна тут https://www.java.com/ru/download/
java_notfound=Java не знайдена
ON=ТАК
OFF=НІ
MANUAL=ВРУЧНУ
project=Поточний проект                             
currentapk=Обраний APK                                 
currentjar=Обраний JAR                                 
apilevel=рiвень API                                
keepbroken=залишити пошкодженi ресурси               
buildexpert=зiбрати в експертному режимi              
dontwritedebug=Видалити iнфо. для вiдлагодження з smali    
signafter=Пiдписати отриманий APK                     
key=ключ для пiдпису                          
openlog=Вiдкрити лог                                                          
language=Мова                                        
deodexall=Деодексувати всi APK та JAR                 
copy_deodexed_apk=Копіювати деодексовані APK до _INPUT_APK    
copy_deodexed_jar=Копіювати деодексовані JAR до _INPUT_JAR    
baksmaliapk=Декомпiлювати APK (тiльки smali)
smaliapk=Рекомпiлювати APK
baksmalijar=Декомпiлювати JAR (тiльки smali)
smalijar=Рекомпiлювати JAR
decompile=Декомпiлювати APK                           
decompile_r=Декомпiлювати APK (тiльки ресурси)          
recompile=Рекомпiлювати APK                           
signfiles=Пiдписати АРК
zipalfiles=Вирівняти APK
viewsource=Показати вихідний код Java >
plugins=Плагіни >
selplugin=ВИБЕРІТЬ ПЛАГІН:
adbmenu=ADB:
devices=Підключення пристрою >                      
install=Встановити APK >                            
rootremount=Режим root, монтування для запису           
pull=Скопіювати з пристрою >                     
push=Скопіювати на пристрій >                    
screenshot=Зробити знімок екрану                       
screenrecord=Записати відео з екрану
shell=Відкрити термінал
logs=Показати логи >
reboot=Перезавантажити пристрій >
info=Інформація про пристрій
kill-server=Завершити роботу ADB
servicemenu=ОБСЛУГОВУВАННЯ:
cleanup1=Очистити теки _framework, _system           
cleanup2=Очистити теки _INPUT_APK, _INPUT_JAR        
cleanup3=Очистити теки _OUT_APK, _OUT_JAR
cleanup4=Очистити ВСІ теки
exitmenu=ВИХІД
choosetask=БУДЬ ЛАСКА, ОБЕРІТЬ ЗАВДАННЯ:
instframe=Встановлення фреймворка
instframe_error=Помилка встановлення фреймворка
inputapk_empty=Помістіть файли для декомпіляції в теку _INPUT_APK. Деталі дивіться в readme.txt.
decompiling=Декомпіляція
decompiling_error=Помилка декомпіляції
recompiling=Рекомпіляція
recompiling_error=Помилка рекомпіляції
orignotfound=ПОМИЛКА^! Оригінальний файл не знайдено.
backupnotfound=ПОМИЛКА^! Тека _backup не знайдена.
done=ВИКОНАНО
signing=Підписування
signing_error=Помилка підписання
doneerrors=ВИКОНАНО з ^!error_count^! ПОМИЛКАМИ.
zipal=Вирівнювання
zipal_error=Помилка вирівнювання
selectviewer=Переглядач вихідного коду Java:
cancel=СКАСУВАТИ
makechoice=Зробіть вибір:
dragajd=перетягтіть APK, JAR чи DEX-файл сюди:
genjava=Генерація Java-коду з
genjava_error=Помилка генерації Java-коду з
apilevel_log=Рівень API                  
buildexpert_log=Експертний режим            
signafter_log=Підписаний                  
press1=Натисніть ENTER для продовження чи введіть 1, щоб відкрити лог:
deletedialog=Видалення всіх файлів в теках:
proceed=Продовжити?
yes=ТАК
selproj=ВИБЕРІТЬ ПРОЕКТ:
createnewproj=Створити новий проект
usedefproj=Використовувати проект по замовчуванню
inputprojname=Введіть назву проекту:
selectapk=ВИБЕРІТЬ APK:
allapks=Всі APK в _INPUT_APK
selectjar=ВИБЕРІТЬ JAR:
alljars=Всі JARs в _INPUT_JAR
selectapktool=ВИБЕРІТЬ APKTOOL:
selectsmali=ВИБЕРІТЬ SMALI:
aversions=Версія Android
apilevels=Рівень API     
enterapi=Введіть рівень API:
invalidapi=Невірний рівень API^!
selectkey=ВИБЕРІТЬ КЛЮЧ:
selectlang=ВИБЕРІТЬ МОВУ:
framework_empty=Помістіть всі фреймворки в теку _system\framework. Деталі дивіться в readme.txt.
deodexing=Деодексація
notodexed=Файл не одексований.
smerror=Помилка рекомпіляції (smali)
bsmerror=Помилка декомпіляції (smali)
bootnotfound=boot.oat не знайдено
selectarch=ВИБЕРІТЬ АРХІТЕКТУРУ ДЛЯ ДЕОДЕКСАЦІЇ:
selectedarch=Архітектура
extractboot=Розпаковування та деодексація boot.oat...
extractboot_error=Помилка розпаковування boot.oat
errorunp=Помилка розпаковування
deodexing_error=Помилка деодексації
baksmaling=Декомпіляція (smali)
smaling=Рекомпіляція (smali)
connection_type=Тип з`єднання:
input_ip=Введіть IP пристрою, наприклад 192.168.1.3:
input_ip2=Введіть IP або натисніть ENTER, щоб використовувати останній IP
installtodef=Встановити у пам`ять телефону:
singlefile=Один файл
allfrom=Всі файли з
installtosd=Встановити на SD-карту:
dragtoinstall=Перетягніть сюди APK для встановлення:
installing=Встановлення
pull2=Скопіювати з пристрою:
pushto=Скопіювати в
dragtopush=Перетягніть сюди файли для копіювання:
screensavedto=Знімок екрану збережений у файл
closetostop=Закрийте це вікно, щоб зупинити запис
scrrecsavedto=Запис з екрану збережена у файл
logcatr=радіо
logcate=події
toscreen=показати та зберегти у файл
tofile=Зберегти у файл
bugreport=Детальний звіт:
inlinetable=Таблиця inline-методів:
saved_to_file=Лог збережений у файл
android_version=Версія Android:
brand=Марка:
model=Модель:
reboot2=Перезавантаження:
reboot3=Перезавантажити
rebootto=Перезавантажити у
symlinks=СИМВОЛЬНІ ПОСИЛАННЯ
copied_files=Скопійовано файлів:
old_smali_used=Для деодексації виберіть smali 2.2 або вище
already_deodexed=Файл уже деодексован.
onefrom=Один файл з
alt_method=альтернативний метод
tool_for_deodex=Утиліта для деодексації Android 6.x-7.x                               
del_symlinks=Видаляти симлінки після деодексації                                   
rewrite_opt=Попереджувати про перезапис папки при декомпіляції                    
warn_rewrite1=Знайдена папка з декомпільованим додатком
warn_rewrite2=Введіть 1 для перезапису папки, або натисніть ENTER для відміни:
sound_opt=Звукові сповіщення                                                    
manifest_opt=Зберігати оригінальний AndroidManifest.xml                            
AUTO=АВТО
AUTO+=АВТО+
necessary_files_missing=Подальша робота Batch ApkTool неможлива, так як відсутні один або кілька необхідних для роботи файлів
dex_notfound=Файл не містить classes.dex, він повинен бути деодексован перед декомпіляцією.
elapsed_time=Витрачено часу
elapsed_h=г.
elapsed_m=хв.
elapsed_s=сек.
tool_for_deodex_vdex=Утиліта для деодексації Android 8.x                                   